#include "rtc_cfg.h"

//===每个月的天数,默认是12个月，这样正好对应数组的1到12，故数组大小是13字节
const uint8_t g_month_days_table[13] = { 0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31 };

///////////////////////////////////////////////////////////////////////////////
//////函		数:
//////功		能: 根据年月日计算是星期几（使用基姆拉尔森计算公式）
//////输入参数:
//////输出参数: 1---星期一；2---星期二；3---星期三；4---星期四；5---星期五；6---星期六；7---星期天；0---错误
//////说		明:
//////////////////////////////////////////////////////////////////////////////
uint8_t rtc_calc_week(RTC_TimeType* RTCx)
{
	//---年
	int temp_y = RTCx->msg_years;
	//---月
	int temp_m = RTCx->msg_month;
	//---日
	int temp_d = RTCx->msg_day;
	//---星期
	int temp_w = -1;
	uint8_t _return = 0;
	////////////////////////////////////////////////////////////////////////////////////////////////
	////基姆拉尔森计算公式:
	////W= (d+2*m+3*(m+1)/5+y+y/4-y/100+y/400) mod 7
	////在公式中d表示日期中的日数，m表示月份数，y表示年数。
	////注意:在公式中有个与其他公式不同的地方:
	////把一月和二月看成是上一年的十三月和十四月，例:如果是2004-1-10则换算成:2003-13-10来代入公式计算
	////////////////////////////////////////////////////////////////////////////////////////////////
	if (1 == temp_m || 2 == temp_m)
	{
		temp_m += 12;
		temp_y--;
	}
	temp_w = (temp_d + 1 + 2 * temp_m + 3 * (temp_m + 1) / 5 + temp_y + temp_y / 4 - temp_y / 100 + temp_y / 400) % 7;
	//---解析星期几
	switch (temp_w)
	{
		case 0:
		{
			_return = 7;
			break;
		}
		case 1:
		{
			_return = 1;
			break;
		}
		case 2:
		{
			_return = 2;
			break;
		}
		case 3:
		{
			_return = 3;
			break;
		}
		case 4:
		{
			_return = 4;
			break;
		}
		case 5:
		{
			_return = 5;
			break;
		}
		case 6:
		{
			_return = 6;
			break;
		}
		case 7:
		{
			_return = 7;
			break;
		}
		default:
		{	
			_return = 0;
			break;
		}
	}
	return _return;
}